Revit 2024 API
LightType.DimmingColor Property
 The dimming temperature value in Kelvins.
Namespace: Autodesk.Revit.DB.Lighting
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public LightDimmingColor DimmingColor { get; set; }
Visual Basic
Public Property DimmingColor As LightDimmingColor
	Get
	Set
Visual C++
public:
property LightDimmingColor DimmingColor {
	LightDimmingColor get ();
	void set (LightDimmingColor value);
}
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentOutOfRangeException |  When setting this property: A value passed for an enumeration argument is not a member of that enumeration
See Also
LightType Class
Autodesk.Revit.DB.Lighting Namespace